//1.Пароль і 4 спроби. Завдання виконуємо через while або do while.
let count = 0;
let pass = prompt("Введіть пароль");
while (pass !== "Zabor") {
    count++;
    if (count <= 3) {
        alert(`Залишилось спроб ${4-count}`);
        pass = prompt("Введіть пароль");
    } else if (count == 4) {
        alert("Будь ласка спробуйте пізніше!");
    }
};
console.log('Кількість неправельних введень =', count);
alert("Запрошуємо на сайт!");

//2. Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
let num = prompt("Введіть число");
let result = 1;
while (num != 0) {
    result *= num;
    num -= 1
}
console.log(result);

//3 Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999
let a = 1000;
while (a <= 9999) {
    a += 3;
    if (a > 9999) break;
    console.log(a)
}
//4 Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17...
let b = 1;
let firstEl = 0;
while (firstEl != 55) {
    firstEl++;
    b += 2;
    console.log(b)
}
//5Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 …
let c = 90;
while (c != 0) {
    console.log(c);
    c -= 5;
};
//6Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128;
let d = 1;
let secondEl = 0;
while (secondEl != 20) {
    secondEl++;
    d *= 2;
    console.log(d);
}
//7. Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.
let e = 2;

do {
    e = 2 * e - 1
    if (e < 10000) {
        console.log(e)
    }
} while (e < 10000);
//8  Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), де початкове значення змінної a = -166.
let a = -166;
while (a < 99) {
    a = a * 2 + 200;
    if (a > -100 && a < 100) {
        console.log(a)
    }
};
//9Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти. Задачу бажано виконати використовуючи 1 цикл!
let n1 = +prompt("Введіть число");
let n2 = +prompt("Введіть степінь");
let i = 1;
let result = 1;
if (n2 > 0) {
    while (i <= n2) {
        result *= n1;
        i++
    }
} else if (n2 < 0) {
    while (i > n2 + 1) {
        result /= n1;
        i--
    }
} else {
    n1 * 0
}
console.log(result)