//1 — Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
let n = prompt("Введіть число");

function factorial(n) {
    return (n != 1) ? n * factorial(n - 1) : 1;
}
console.log(factorial(n))

//2 — Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999
for (let a = 1000; a <= 9999; a += 3) {
    document.write(`<h2>на рахунок:${a}</h2>`);
}
//3 — Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…
let b = 1;
for (let i = 1; i <= 55; i++) {
    b += 2;
    console.log(b)
};

//4— Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…

for (let d = 90; d >= 0; d -= 5) {
    console.log(d);
};

//5— Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…
let c = 1;
for (let i = 0; i < 20; i++) {
    c *= 2;
    console.log(c)
}
//6  Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), 
//де початкове значення a = 2 та які менше 10000.

let a = 2;

do {
    a = 2 * a - 1
    if (a < 10000) {
        console.log(a)
    }
} while (a < 10000);

// або
for (let a = 2, i = 1; i < a; a = a * 2 - 1, i++) {
    if (a < 10000) {
        console.log(a)
    }
}


//7— Виведіть на екран всі двозначні члени 
//послідовності 2a+200(крок зміни лічильника), 
//де початкове значення змінної a = -166.

for (let a = -166; a < 100; a = a * 2 + 200) {

    if (a > -100 && (a < -9 || a > 9)) {
        console.log(a)
    }

}

//8 — Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
let n1 = +prompt("Введіть число");
let n2 = +prompt("Введіть степінь");
let result = 1;
if (n2 > 1) {
    for (let i = 1; i <= n2; i++) {
        result *= n1;
    }
} else if (n2 < 0) {
    for (let i = -1; i >= n2; i--) {
        result /= n1;
    }
} else {
    n1 * 0
}
console.log(result);