let check = prompt("Ввeдіть число");
if (check == 1) {
    alert("Ви ввели порядковий номер місяця: Січень")
} else if (check == 2) {
    alert("Ви ввели порядковий номер місяця: Лютий")
} else if (check == 3) {
    alert("Ви ввели порядковий номер місяця: Березень")
} else if (check == 4) {
    alert("Ви ввели порядковий номер місяця: Квітень")
} else if (check == 5) {
    alert("Ви ввели порядковий номер місяця: Травень")
} else if (check == 6) {
    alert("Ви ввели порядковий номер місяця: Червень")
} else if (check == 7) {
    alert("Ви ввели порядковий номер місяця: Липень")
} else if (check == 8) {
    alert("Ви ввели порядковий номер місяця: Серпень")
} else if (check == 9) {
    alert("Ви ввели порядковий номер місяця: Вересень")
} else if (check == 10) {
    alert("Ви ввели порядковий номер місяця: Жовтень")
} else if (check == 11) {
    alert("Ви ввели порядковий номер місяця: Листопад")
} else if (check == 12) {
    alert("Ви ввели порядковий номер місяця: Грудень")
} else if (check <= 0 || check > 12) {
    alert("Ви ввели невірний порядковий номер місяця!")
} else {
    alert("Ви ввели текст")
}